Repository: maabou512/ospo_paper2021
Catalog: LFResearch_OSPO_Report Folder/omegaT_Rainbow/pack1/pack1-level2.tmx
Source language: en_us
Languages: ja_jp

source: The purpose of this report is twofold: to present key findings from the latest annual OSPO survey and to provide context for these results through interviews with leading practitioners and experts.
ja_jp: 本レポートの目的は、最新の OSPO 年次サーベイ（OSPO Annual Survey）から得られた重要な知見を提示すること、および先進的な実践者や専門家へのインタビューを通じてこれらの結果のコンテキストを提供すること、の2つとなります。

source: The real risks of noncompliant OSS consumption, including the usage of OSS products from projects or code without formal licenses
ja_jp: 正式なライセンスがないプロジェクトやコードの OSS の使用を含め、「準拠していない」OSSの消費に関する実際のリスク

source: The role of the Bloomberg OSPO progressed from tactical to strategic.
ja_jp: Bloomberg の OSPO の役割は、戦術的（Tactical）なものから戦略的（Strategic）なものへと進歩したのです。

source: The second goal is to be supportive and engaged with the broad open source community by giving back, actively engaging with it, and helping the community innovate faster.
ja_jp: 第二の目標は、広範なオープンソース コミュニティに還元、積極的エンゲージメント、イノベーションの加速といったことでエンゲージし、コミュニティの支援者になることです。

source: The survey also revealed hopeful signals.
ja_jp: また、今回の調査で期待が持てる兆候も見えてきました。

source: The survey data showed an increase from 54% to 63% in respondents saying the OSPO was very or extremely critical to the success of their engineering or product teams.
ja_jp: そして調査データは、OSPO が自社エンジニアリングチームや製品チームの成功に非常に重要であるとした回答者が 54% から 63% へ増加したことを示しています。

source: The survey revealed that organizations use more OSS than they contribute to OS projects, and responding organizations are not fully aware of OSPOs:
ja_jp: また本調査では、回答した組織は OSS プロジェクトへコントリビュートするよりも OSS を使用することの方が多いこと、そういった組織で OSPO が十分に認知されていないことが明らかになりました：

source: The tasks of the OSPO have advanced on critical fronts to include:
ja_jp: OSPO の担うタスクは、以下を含め重要性の高い前線へと張り出してきました。

source: The two approaches are generally seen as neighboring points on the software development continuum.
ja_jp: この2つのアプローチは、一般的にソフトウェア開発の「連続体」における隣接点とみなされています。

source: The use of contributor license agreements (CLAs) to cover an organization’s developers who contribute to open source
ja_jp: オープンソースにコントリビュートする自社開発者たちを対象としたCLA（Contributor License Agreements）の使用

source: The very elements that made OSS so powerful for accelerating technology innovation and so attractive to developers and “problem-solving” engineers—transparency, rapid iteration, collaborative innovation—were characteristics that often concerned legal teams and went against the grain of traditional technology development strategy.
ja_jp: イノベーションを加速するために OSS を強力なものにし、開発者や「問題解決」を業務とするエンジニアたちにとって魅力あるものにする、まさにそういった要素 ― 透明性、ラピッド イテレーション、コラボレーションによるイノベーション ― は、しばしばリーガル チームの懸念となる、従来の技術開発戦略の特徴に反するものでした。

source: There are dozens of OSS licenses in use.
ja_jp: 使われている OSS ライセンスは多数あります。

source: There are no policies for license compliance in place, and developers do what they feel is right,” said Dirk Riehle, professor of open source software at the Friedrich-Alexander University Erlangen-Nürnberg.
ja_jp: ライセンス コンプライアンスに関するポリシーは存在せず、開発者たちは自分たちが正しいと思うことを行うのです。」と、フリードリヒ・アレクサンダー大学エアランゲン＝ニュルンベルクでオープンソースソフトウェアを専門とする Dirk Riehle 教授は述べています。

source: These OSPOs tend to work closely with CTOs and company strategists to map open source projects and capabilities.
ja_jp: こういった OSPO では、CTOや企業戦略の担当者たちと密接に協力する傾向にあり、そうすることでオープンソース プロジェクトと自社ケイパビリティとを対応さていきます。

source: These are critical because, once adopted, those open source components become part of the organization software supply chain by default, which makes a strategic approach all the more imperative.
ja_jp: これらは非常に危機的な状況と言えます。なぜなら前述したようなオープンソースのコンポーネントが採用されると、それらはそのまま組織のソフトウェア サプライチェーンの一部となりますが、そういった状況では戦略的なアプローチがなくてはならないものになっているからです。

source: These are the rare OSPOs that form or facilitate the formation of large, complex open source projects inside an organization and then launch them as publicly available projects.
ja_jp: この原型をもつ OSPO は少ないですが、大規模で複雑なオープンソース プロジェクトを組織内で形成、ファシリテートし公開プロジェクトとして立ち上げていきます。

source: These metrics may include engineering participation rates in OSS projects (pull requests, comments, commits), attendance and participation at open source events, blog posts written, talks given, and participation in open source project slacks, to name a few.
ja_jp: これらのメトリックには、OSS プロジェクトへのエンジニアリング参加比率（プルリクエスト、コメント、コミット）、オープンソース イベントへの出席や参加、ブログ投稿の執筆、講演、オープンソースプロジェクトの Slack チャネルへの参加、といったものが例として挙げられます。

source: They came to the realization, ‘We didn’t just want to be consumers [of OSS]; we wanted to be collaborators.’”
ja_jp: 彼らは『自分たちは単なる（OSSの）コンシューマーたちになりたかったのではなく、コラボレーターになりたかったんだ』ということに気がついたのです」

source: They don’t confuse this level of organizational commitment with individual employees who decide to open-source their projects.
ja_jp: 彼らは、この、組織としてコミットするレベルの話と、プロジェクトをオープンソース化すると決めた社員個人レベルでの話とを混同せず、分けて考えます。

source: They had a tacit understanding that the company frowned upon public discussion about internal technology.
ja_jp: それは、彼らに社内の技術について公の場で議論することについて会社が難色を示す、という暗黙の理解があったからです。

source: They may use OSS as a building block or library in a product or tool or a key part of a vendor’s product stack or supporting the vendor’s service offering.
ja_jp: 製品やツールの中でビルディング ブロックやライブラリの一つとして OSS が使われるかもしれませんし、ベンダーの製品スタックの主要部分となって使われていたり、ベンダーのサービスオファリングをサポートするときに使われていたりするのかもしれません。

source: They understand that the security practices of OSS projects differ from those of proprietary software companies.
ja_jp: そして彼らは、OSS プロジェクトのセキュリティ プラクティスがプロプライエタリなソフトウェア会社のそれと異なっていることを理解しています。

source: They will dedicate one or more FTEs to a project, and they accept responsibility for nurturing a project commu nity and ensuring its health.
ja_jp: 彼らは1人以上のフルタイムの従業員をそのプロジェクトに専念させるようになっていきます。また彼らはプロジェクト コミュニティを育成し、その健全性を確保する責任も担います。

source: They will eventually set up an open source program office with the mandate to get a handle on open source use and contribution.
ja_jp: 彼らもゆくゆくは、オープンソースの使用とコントリビューションを管理する権限を持った、Open Source Program Office を設立することになるでしょう。

source: This also helps Comcast attract and retain talented open source developers into the company.
ja_jp: またこれは、Comcast が優れたオープンソース開発者たちを同社が惹きつけ、自社に留め置くことにつながります。

source: This approach differs from the siloed model of software development with teams working on projects, sometimes duplicating efforts.
ja_jp: このアプローチは、複数のプロジェクトチームの活動において、時として複数の取り組みが冗長的なものとなる「サイロ」型のソフトウェア開発モデルとは異なったものです。

source: This archetype is far more likely to incubate or participate in big projects and more likely to have dedicated developers working exclusively on open source.
ja_jp: この原型は、大きなプロジェクト（へ）のインキュベーション・参加を非常に起きやすくし、オープンソース専門で活動する開発者たちを生みだしやすくします。

source: This consortium also works on non-industry-specific OSS problems, such as creating and maintaining a stack of tooling to automate OSS compliance and verification.
ja_jp: また、こういったコンソーシアムは、OSS コンプライアンスと検証を自動化するツールのスタックを作成、メンテナンスするなど、業界特有ではない OSS の問題にも取り組んでいます。

source: This consultative role usually indicates a similar approach at lower levels, where the OSPO and its members or ambassadors may act as internal consultants to help developers and teams better understand, interact with, consume, and plan around open source technologies.
ja_jp: この「コンサル的」な役割は、通常実務レベルでも同様のアプローチとして表れてきます。OSPO とそのメンバーもしくは代表者が内部コンサルタントとして活動し、開発者やチームがオープンソースの技術をよりよく理解し、連携し、消費し、計画するのを支援します。

source: This decline may reflect the change in survey composition: It includes industries such as education and government, where open source programs are in their infancy.
ja_jp: この回答率の低下は調査対象の構成変化を反映した可能性があります。調査対象には、教育や政府機関など、オープンソースへの取り組みがまだ始まったばかりの業界も含まれています。

source: This enables Tesla to treat feature development as more of a software problem.
ja_jp: これにより、Tesla は機能開発をよりソフトウェアの問題として扱うことができるのです。

source: This evolution fits the ongoing theme of continued growth and acceptance of OSS and development practices in organizations large and small.
ja_jp: この進化は、大小を問わず組織における OSS と開発実務についての継続的な受容と成長という、現在進行中のテーマに合うものです。

source: This for us is a game changer,” says Peters.
ja_jp: これは私たちにとって、『ゲームチェンジャー』なのです。」と、Peters は言います。

source: This helped us build a business case to the CNCF that these two projects have enough traction that they should be added to the Foundation’s sandbox.”
ja_jp: こういったことが、これら2つのプロジェクトが CNCF のサンドボックスに取り込まれるだけの十分な牽引力を持っている、という「ビジネスケース」を CNCF に対して作成することにつながったのです。」

source: This list of archetypes will evolve as we conduct more research on the activities of OSPOs and the organizations they support.
ja_jp: これまでに挙げた原型のリストは、私たちがOSPO の活動、彼らが支援する組織についてさらに調査の手を広げるにしたがって進化していくことでしょう。

source: This move was a logical expansion of Bloomberg’s public outreach and its ecosystem footprint; Fleming was already involved in reviewing content proposals for external speaking.
ja_jp: この動きは、Bloomberg の対外的なアウトリーチ活動とエコシステムのフットプリントをロジカルに広げるものであり、Fleming はこのときすでに外部でのスピーチに向けプロポーザルのコンテンツレビューに関わっていました。

source: This outreach includes advocating for and driving event sponsorships, booking project leads and maintainers as speakers or panelists in public coding forums, and securing organizational resources (e.g., talent, funding) to mission-critical OSS projects.
ja_jp: こういた「アウトリーチ」には、イベント スポンサーシップの提唱と推進、公開コーディングフォーラムでのプロジェクトリーダーとメンテナーの講演者またはパネリストとしての登壇調整、ミッションクリティカルな OSS プロジェクトへの組織内リソース（人材やファンドなど）の確保、といったものも含まれます。

source: This parallels the digital transformation of society.
ja_jp: これが、社会の「デジタルトランスフォーメーション（DX）」と並行しています。

source: This practice has extended beyond initial decisions to retracting resources from projects that change licenses or governance in ways that go against Bloomberg’s preferred best practices.
ja_jp: このプラクティスは最初の意思決定の段階だけでなく、 Bloomberg の推奨するベストプラクティスに反したやり方でライセンスやガバナンスを変えてしまうようなプロジェクトからリソースを撤収させる、といった運用の段階にまで広がっています。

source: This preference is less resource intensive but cedes control of a project to a broader community.
ja_jp: この方向性では、リソース集約性は相対的に低くなりますが、プロジェクトのコントロールがより広範なコミュニティに委ねられることになります。

source: This publication seeks to provide a broader framework for understanding the archetypes of OSPOs and the maturity stages that we have seen in our work with thousands of enterprises and organizations as they have moved through their open source journeys.
ja_jp: 本書は、「OSPO の原型（Archetype）」と、何千もの企業や組織がしてきたオープンソースの「旅」（ジャーニー）を見てきた中で見えてきた「成熟段階」について理解するための、幅広いフレームワークを提供しようとするものです。

source: This report is provided “as is.” The Linux Foundation and its authors, contributors, and sponsors expressly disclaim any warranties (express, implied, or otherwise), including implied warranties of merchantability, noninfringement, fitness for a particular purpose, or title, related to this report.
ja_jp: （原文併記）This report is provided “as is.” The Linux Foundation and its authors, contributors, and sponsors expressly disclaim any warranties (express, implied, or otherwise), including implied warranties of merchantability, noninfringement, fitness for a particular purpose, or title, related to this report. 本レポートは「現状有姿」の状態~~無保証~~（As-Is）で提供されます。The Linux Foundation およびその著者、コントリビューター、スポンサーは、本レポートに関する商品適格性、非侵害、特定目的適合性、もしくは権原についての黙示的な保証を含め、いかなる保証（明示的なもの、黙示的なもの、その他のものを問わず）についても明示的にその責任を負いません。

source: This report would not have been possible without Alex Salkever, who skillfully led the research and writing effort, and TODO Group’s Ana Jimenez, for helping with project design and outreach.
ja_jp: 本レポートにおける調査と執筆を巧みにリードした Alex Salkever と、プロジェクトのデザインとアウトリーチに協力してくれた TODO グループ Ana Jimenez なしでは本レポートは実現できなかったでしょう。

source: This usage is typically internal, not part of products or services to customers or users.
ja_jp: この使用は通常内部的なものであり、顧客またはユーザー向けに提供された製品またはサービスの一部ではありません。

source: This work often takes the shape of other tooling to automate consumption and compliance of open source work on open source programming languages and frameworks, such as JavaScript and Node.js.
ja_jp: この取り組みでは、JavaScript や Node.js など、オープンソースのプログラミング言語 やフレームワークに対し、その消費やコンプライアンス対応を自動化するためのツールを用意することがよくあります。

source: This work often takes the shape of other tooling to automate consumption and compliance of open source work on open source programming languages and frameworks
ja_jp: この原型に基づく活動は、オープンソースのプログラミング言語やフレームワークを用い、オープンソースの使用やコンプライアンスを自動化するツールとして見えてくることが多い

source: This work provides guidance and a roadmap for these journeys, as the concept and structure of OSPOs continue to evolve with the open source movement.
ja_jp: これから本書で、OSPO のコンセプトや構造がオープンソースの潮流とともに進化し続ける中でのこれらの「旅」に向けてガイド、ロードマップを提供していきます。

source: This “ad hoc adoption” usually means little thought is given to license compliance outside the defaults or to longer-term impacts of consuming open source and distributing products built with open source components.
ja_jp: この「アドホック（場当たり的）な採用」は、通常デフォルト以外の状況でのライセンスコンプライアンスや、オープンソースを消費（Consume）したり、オープンソースのコンポーネントを用いて構築された製品を配布したりすることによる、長期的な影響について、ほとんど考慮されていないことを意味します。

source: Those Cs are “communications, consumption, contribution, collaboration, compliance and culture, all key attributes of developing in the open and building healthy open source ecosystems.
ja_jp: これらの C は、コミュニケーション（Communication）、消費・使用（Consumption）、コントリビューション（Contribution）、コラボレーション（Collaboration）、コンプライアンス（Compliance）、文化（Culture）で、これらはすべてオープンな開発と健全なオープンソースエコシステムを築くための重要な属性です。

source: Those goals included:
ja_jp: これらの目標とは以下のようなものです。

source: Those who did not suffered consequences, with poor security practices that had financial impact.
ja_jp: 結果としてこういった組織は、セキュリティ上の不備による財務的な被害を受けることがありませんでした。

source: Through developer education, senior management often acknowledges the value and importance of OSS.
ja_jp: 上位管理層が開発者教育を通じ、OSS の価値と重要性を認識することもしばしばあります。

source: Through leveraging project databases and networks, and a commitment to best practices in quantitative and qualitative methodologies, Linux Foundation Research is creating the go-to repository for open source insights for the benefit of organizations the world over.
ja_jp: Linux Foundation Research は、プロジェクトデータベースやネットワークの活用と、定量的および定性的なメソドロジーにもとづくベストプラクティスへの関心から、世界中の組織の利益のために、オープンソースに関する洞察に有用となるリポジトリを作りあげる活動をしています。

source: To a certain degree, any organization calling itself an OSPO likely indicates that the organization has reached a maturity stage and critical mass, where it OSPOs share key characteristics:
ja_jp: 自らを「OSPO」と名乗れるなら、そういったすべての組織は一定レベルでどこかの成熟段階に達していて、クリティカル・マスにきている、と言えそうです。このような 組織では、OSPO の共通的特徴があります。

source: To be fair, Peters feels that Porsche has made great improvements but has a long way to go.
ja_jp: とはいえ実際のところ、Porsche はとてもよくなってきたものの、まだまだ進むべき道のりは長いと Peters は感じています。

source: To fulfill those goals and more, Comcast developed what it calls the “6 Cs Strategy” for its open source practice.
ja_jp: Comcast はこれらの目標を達成するために、オープンソースへ実務向けに「『6C』戦略」と呼ぶものを作成しました。

source: To gain more qualitative insights into how OSPOs were evolving, we interviewed leaders of noted OSPO programs, including some of the most influential technology firms, such as Red Hat, Microsoft, and VMware, as well as some one of the most iconic transportation brands and one of the largest media and entertainment companies.
ja_jp: OSPO がどのように進化していったか、についてより定性的な洞察を得るために、私たちは、Red Hat、Microsoft、VMware などの最も影響力のあるテック企業に加え、最も象徴的な「移動手段」のブランド、 メディア、金融サービス、輸送、各業種での OSPO の各段階を歩む「旅」と 最大のメディア企業、および最大のエンターテイメント企業、それぞれ1社に対して、際立った OSPO の取り組みをしているリーダーたちへインタビューを行いました。

source: To hit that goal, Porsche will need all the boost it can get from leveraging open source.
ja_jp: Porsche はこの目標に到達すべく、オープンソースを活用することで得られるすべての推進力を必要とすることになるでしょう。

source: To maintain compliance, organizations in Stage 1 of OSPO maturity create education programs to help their developers decide when to use OSS in creating new products or services.
ja_jp: コンプライアンスを維持するために、OSPO 成熟度「ステージ1」の段階にある組織は、教育プログラムを作成して、開発者たちが新しい製品やサービスを開発する際に、「いつ」OSS を使用するか、を判断できるようにサポートします。

source: To properly measure impact on open source, Comcast began tracking contributions in 2013.
ja_jp: オープンソースにおける影響を適切に計測するため、Comcast は2013年にコントリビューションの追跡を開始しました。

source: To reference the work, please cite as follows: Chris Aniszczyk, “The Evolution of the Open Source Program Office,” foreword by Jim Zemlin, The Linux Foundation, February 2022.
ja_jp: なお、本書を参考文献として引用する場合は、以下のようにしてください：Chris Aniszczyk, “The Evolution of the Open Source Program Office,” foreword by Jim Zemlin, The Linux Foundation, February 2022.

source: To simplify education, Fleming and the team at Bloomberg wrote an internal handbook outlining all the considerations and steps a team or employee should take before launching.
ja_jp: また、Fleming とBloomberg チームは、教育をシンプルにするべくチームや社員向けにローンチ前でのすべての考慮事項、ステップを概説した社内向けハンドブックを執筆しました。

source: To technology organizations, employing a contributor to a prominent OSS project is a valuable investment: most of their contributors to, say, the Linux kernel—the core component of the Linux operating system and the critical interface between computer hardware and software—are full-time employees (FTEs) whose job is to write code for Linux.
ja_jp: テック企業にとって、卓越した OSS プロジェクトのコントリビューターを雇用することは価値ある投資です。たとえば、Linux カーネル ― Linux オペレーティングシステムのコアコンポーネントであり、コンピュータハードウェアとソフトウェアの間の重要なインターフェイスでもあります ― へのコントリビューターのほとんどは、Linux 用のコードを書くことを職務とする、フルタイムの従業員（FTE：Full-time employee）です。

source: To that end, 51% said a funding increase was very or somewhat likely.
ja_jp: 最終的には 51% がファンディングの増加について、「非常にありうる」もしくは「あるt程度ならありうる」と回答しています。

source: To that end, VW set up Cariad as a standalone business to create software for all the brands of the conglomerate and pool resources.
ja_jp: そのため、VWは、彼らのコングロマリット全体のブランドに対するソフトウェアを開発し、リソースプールを作るべく、グループとは独立した企業として CARIAD を設立しました。

source: To which a third commented with a frowning face: “What are you talking about?
ja_jp: するそれに対し三人目が眉をひそめながらこう言いました。「一体何の話をしてるんだい?

source: Today Red Hat dedicates more resources to earlier life cycle activities, such as educating internal stakeholders (e.g., sales teams, marketing personnel, new engineering hires) and fostering collaboration in upstream communities.
ja_jp: 現在 Red Hat では、社内のステークホルダー（セールス チーム、マーケティング担当者、新規エンジニアなど）の教育や、上流コミュニティでのコラボレーションの促進など、ライフサイクル初期の活動に多くのリソースを投入しています。

source: Today all open source software compliance and approvals runs through the OSPO.
ja_jp: 今日ではオープンソースソフトウェアのコンプライアンスと承認のすべてが OSPO を通じて行われています。

source: Today, almost all organizations use OSS.
ja_jp: 現在、ほとんどすべての組織でOSSが使われています。

source: Today, the Comcast OSPO has grown to become an internal center of excellence and consultancy for all-things open source.
ja_jp: 今日では、Comcast の OSPOは、あらゆるオープンソースの有益性の周知とコンサルティングのための内部センターに成長しました。

source: Today, we are very strategic in the way we do OSS,” says Ruff.
ja_jp: 今日、私たちのOSSを活用の仕方はとても戦略的なものになっています。」と、Ruff は言います。

source: Together with Porsche Digital (serves as the digital competence center of Porsche) we needed to drive contributions to OSS, create inner sourcing programs, and make sure our OSS was secure,” explains Peters.
ja_jp: Porsche Digital（Porsche のデジタルコンピタンスセンターとして機能）と一緒に OSS へのコントリビューションを推進し、インナーソーシング プログラムを作成し、当社の OSS がセキュアであることを確実する必要がありました。」と、Peters は言います。

source: Traffic control was a key technology component in Comcast’s software and services stack, used for delivering mission critical content to live customers.
ja_jp: トラフィック制御は、Comcast のソフトウェアとサービス スタックにおいて重要な技術的要素で、ミッションクリティカルなコンテンツをライブ視聴する顧客に配信するために使われていました。

source: Upper-level management is more likely to acknowledge the crucial role that open source technologies play in accelerating innovation and sharing software development costs across multiple beneficiaries.
ja_jp: オープンソースの技術がイノベーションを加速するとともに、複数の受益者間でソフトウェアの開発コストを共有する重要な役割を果たしている、ということを上位マネージメント層が認識していると言えそうです。

source: Usually in Stage 2 of the OSPO maturity cycle (or sometimes in Stage 1, if the company is a software or core technology company), OSPOs begin to streamline and optimize open outbound source contributions for their developers.
ja_jp: 通常 OSPO 成熟サイクルの「ステージ2」において、OSPO は自社開発者のためのアウトバウンドのソースコントリビューションの合理化と最適化をはじめます（企業がソフトウェアまたはコアなテック企業では「ステージ1」の場合もあります）。

source: View open source as a way for their specific industry to become more efficient through sharing costs and innovation for industry-specific needs
ja_jp: オープンソースを、業界特有のニーズに合わせコスト共有やイノベーションを行うことで、その業界の効率を向上させていく一つの手法と考える

source: We also wanted to capture some actual “user journeys,” with real voices from real people relating their real experiences.
ja_jp: また、私たちは実際のユーザーの「旅」を、リアルな人たちからの、リアルな声で、リアルな体験として捉えることを望んでいました。

source: We always want to act in a responsible and supportive way that makes it useful to others.
ja_jp: このためコードが他の人たちにとって使えるものとなるよう、きちんと対応し、サポートする、そういうやリ方で私たちはいつも行動したいと思っています。

source: We asked them how their programs started and how they have evolved.
ja_jp: 彼らに対し、OSPO への取り組みがどのように始まり、どのように進化してきたか、について尋ねました。

source: We believe OSS is a critical component of innovation as a company and a key advantage in attracting great developers to work with us.”
ja_jp: OSSは、企業としてのイノベーションについて非常に重要なコンポーネントであり、優れた開発者を当社に惹き付ける、優位性として鍵となるものだと考えています。」

source: We came from the world of proprietary software,” Fleming said.
ja_jp: 私たちは、プロプライエタリなソフトウェアの世界からきたのです。」

source: We conducted both a survey and interviews under the auspices of the TODO Group, an organization hosted by the Linux Foundation.
ja_jp: 私たちは The Linux Foundation がホストする TODO グループの後援のもとで、年次のサーベイとインタビューを 実施しました。

source: We derived conclusions from the 932 organizations with at least two employees.
ja_jp: ここから、私たちは2人以上の社員を有する 932の組織から結論を導出しました。回答者の構成はこれまでとやや異なり、自身を「自営業」または「無職」とする回答が増加しています。

source: We don’t allow our engineers to contribute to things that are not under the right kinds of open source licenses.
ja_jp: 私たちは、適切な種類のオープンソース ライセンス下にないものにエンジニアたちがコントリビュートすることを許可していません。

source: We don’t know what the future of that project is.
ja_jp: おまけにあのプロジェクトも今後どうなるかはわからないよね。

source: We have been contributing to open source projects for a while now.” This is not unusual.
ja_jp: うちは今も、いままでもずっとオープンソース プロジェクトにコントリビュートしてきたよね。」こういう話は珍しいことではないのです。

source: We have published numerous well-received guides and toolkits on how to build out OSPO programs.
ja_jp: 私たちは、OSPO プログラムを構築する方法について、多くのガイドやツールキットを発行し、それらはよい形で受け止められました。

source: We helped answer those questions.
ja_jp: 私たちはそういった質問に答える支援をしたのです。

source: We hope their insights inform existing and potential OSPO leaders of the nuances of fostering open source.
ja_jp: そして彼らの洞察が、今、これからのOSPO リーダーたちに、オープンソースを促進する「ニュアンス」を伝えてくれることを願っています。

source: We might recommend disinvestment in those projects.
ja_jp: これらのプロジェクトへの投資の中止を勧めるかもしれません。

source: We solicited respondents via social media and direct emails to the Linux Foundation, the TODO Group, and the New Stack subscriber lists.
ja_jp: The Linux Foundation、TODOグループ、および New Stack の購読者たちへ向け、ソーシャルメディアやeメールを通じ回答者を募りました。

source: We track overall participation, but the Open Source Programs Office does set a goal at an individual or team level,” said Stormy Peters, former head of the OSPO at Microsoft.
ja_jp: 私たちは（会社総体として）全体的な参加状況を追跡していますが、個人またはチームのレベルでの目標設定は Open Source Program Office が行っています。」と、Microsoft でOSPOの長を前任していた Stormy Peters は言います。

source: We use GitHub issues for the different process steps.”
ja_jp: 異なるプロセスのステップで GitHub の Issue を使っています。」

source: We would also like to thank VMware for its sponsorship of this research.
ja_jp: また、スポンサーとして本調査を支援してくれたVMwareにも感謝したいと思います。

source: What is its code of conduct, and what are the consequences for breaking it?
ja_jp: そのプロジェクトの行動規範とはどんなものか、それを破ることがどのような結果につながるのか？

source: What is its governance structure, and does this structure ensure independence?
ja_jp: ガバナンスの体制はどうなっているか、独立性が担保されているか？

source: What it needed was guidance and definition on how to participate actively in external open source ecosystems.
ja_jp: 必要だったのは、外部のオープンソース エコシステムへ積極的に参加するための「How-To」についてのガイダンスや定義でした。

source: When we opened the OSPO, one of the first things we did was simplify the process and implement end-to-end tool support.
ja_jp: OSPO を開設したとき、まず私たちがしたことの1つは、プロセスを単純化し、エンドツーエンドでのツールのサポートを実装することでした。

source: When you are in the open source community, you are participating in the open—everyone can see what you are doing.
ja_jp: 自分がオープンソースコミュニティにいるとき、自分はまさに「オープンなもの」 ― 自分が何をしているか、皆に見えるところ― に参加していることになります。

source: Which type of license does it have?
ja_jp: ライセンスの種類は何か？
